nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments10.$name  =  "wakeup_gpio_interrupt_router" ;
resourceAssignments10.devname  = 'J721E_DEV_WKUP_GPIOMUX_INTRTR0' ;
resourceAssignments10.devId   = 137;
resourceAssignments10.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments10.subtypeid  =  0;
resourceAssignments10.resourcerangestart =  0;
resourceAssignments10.resourcecount = 32;






resourceAssignments11.$name  =  "modss0_virtual_interrupts" ;
resourceAssignments11.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_0' ;
resourceAssignments11.devId   = 207;
resourceAssignments11.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments11.subtypeid  =  10;
resourceAssignments11.resourcerangestart =  0;
resourceAssignments11.resourcecount = 64;






resourceAssignments12.$name  =  "modss0_global_events" ;
resourceAssignments12.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_0' ;
resourceAssignments12.devId   = 207;
resourceAssignments12.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments12.subtypeid  =  13;
resourceAssignments12.resourcerangestart =  20480;
resourceAssignments12.resourcecount = 1024;






resourceAssignments13.$name  =  "modss1_virtual_interrupts" ;
resourceAssignments13.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_1' ;
resourceAssignments13.devId   = 208;
resourceAssignments13.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments13.subtypeid  =  10;
resourceAssignments13.resourcerangestart =  0;
resourceAssignments13.resourcecount = 64;






resourceAssignments14.$name  =  "modss1_global_events" ;
resourceAssignments14.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_1' ;
resourceAssignments14.devId   = 208;
resourceAssignments14.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments14.subtypeid  =  13;
resourceAssignments14.resourcerangestart =  22528;
resourceAssignments14.resourcecount = 1024;






resourceAssignments15.$name  =  "udma_virtual_interrupts" ;
resourceAssignments15.devname  = 'J721E_DEV_NAVSS0_UDMASS_INTAGGR_0' ;
resourceAssignments15.devId   = 209;
resourceAssignments15.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments15.subtypeid  =  10;
resourceAssignments15.resourcerangestart =  38;
resourceAssignments15.resourcecount = 218;






resourceAssignments16.$name  =  "udma_global_events" ;
resourceAssignments16.devname  = 'J721E_DEV_NAVSS0_UDMASS_INTAGGR_0' ;
resourceAssignments16.devId   = 209;
resourceAssignments16.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments16.subtypeid  =  13;
resourceAssignments16.resourcerangestart =  38;
resourceAssignments16.resourcecount = 4570;






resourceAssignments17.$name  =  "main_non_secure_proxy" ;
resourceAssignments17.devname  = 'J721E_DEV_NAVSS0_PROXY_0' ;
resourceAssignments17.devId   = 210;
resourceAssignments17.subtype   = 'RESASG_SUBTYPE_PROXY_PROXIES' ;
resourceAssignments17.subtypeid  =  0;
resourceAssignments17.resourcerangestart =  0;
resourceAssignments17.resourcecount = 64;






resourceAssignments18.$name  =  "ra_error" ;
resourceAssignments18.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments18.devId   = 211;
resourceAssignments18.subtype   = 'RESASG_SUBTYPE_RA_ERROR_OES' ;
resourceAssignments18.subtypeid  =  0;
resourceAssignments18.resourcerangestart =  0;
resourceAssignments18.resourcecount = 1;






resourceAssignments19.$name  =  "general_purpose_rings" ;
resourceAssignments19.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments19.devId   = 211;
resourceAssignments19.subtype   = 'RESASG_SUBTYPE_RA_GP' ;
resourceAssignments19.subtypeid  =  1;
resourceAssignments19.resourcerangestart =  440;
resourceAssignments19.resourcecount = 534;






resourceAssignments20.$name  =  "receive_channels_normal_capacity" ;
resourceAssignments20.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments20.devId   = 211;
resourceAssignments20.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX' ;
resourceAssignments20.subtypeid  =  2;
resourceAssignments20.resourcerangestart =  316;
resourceAssignments20.resourcecount = 124;






resourceAssignments21.$name  =  "transmit_channels_normal_capacity" ;
resourceAssignments21.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments21.devId   = 211;
resourceAssignments21.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX' ;
resourceAssignments21.subtypeid  =  3;
resourceAssignments21.resourcerangestart =  16;
resourceAssignments21.resourcecount = 124;






resourceAssignments22.$name  =  "transmit_extended_channels" ;
resourceAssignments22.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments22.devId   = 211;
resourceAssignments22.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_EXT' ;
resourceAssignments22.subtypeid  =  4;
resourceAssignments22.resourcerangestart =  140;
resourceAssignments22.resourcecount = 160;






resourceAssignments23.$name  =  "receive_channels_high_capacity" ;
resourceAssignments23.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments23.devId   = 211;
resourceAssignments23.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_H' ;
resourceAssignments23.subtypeid  =  5;
resourceAssignments23.resourcerangestart =  304;
resourceAssignments23.resourcecount = 12;






resourceAssignments24.$name  =  "resource_24" ;
resourceAssignments24.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments24.devId   = 211;
resourceAssignments24.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_UH' ;
resourceAssignments24.subtypeid  =  6;
resourceAssignments24.resourcerangestart =  300;
resourceAssignments24.resourcecount = 4;






resourceAssignments25.$name  =  "resource_25" ;
resourceAssignments25.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments25.devId   = 211;
resourceAssignments25.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_H' ;
resourceAssignments25.subtypeid  =  7;
resourceAssignments25.resourcerangestart =  4;
resourceAssignments25.resourcecount = 12;






resourceAssignments26.$name  =  "resource_26" ;
resourceAssignments26.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments26.devId   = 211;
resourceAssignments26.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_UH' ;
resourceAssignments26.subtypeid  =  8;
resourceAssignments26.resourcerangestart =  0;
resourceAssignments26.resourcecount = 4;






resourceAssignments27.$name  =  "resource_27" ;
resourceAssignments27.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments27.devId   = 211;
resourceAssignments27.subtype   = 'RESASG_SUBTYPE_RA_VIRTID' ;
resourceAssignments27.subtypeid  =  10;
resourceAssignments27.resourcerangestart =  0;
resourceAssignments27.resourcecount = 4096;






resourceAssignments28.$name  =  "resource_28" ;
resourceAssignments28.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments28.devId   = 211;
resourceAssignments28.subtype   = 'RESASG_SUBTYPE_RA_MONITORS' ;
resourceAssignments28.subtypeid  =  11;
resourceAssignments28.resourcerangestart =  0;
resourceAssignments28.resourcecount = 32;






resourceAssignments29.$name  =  "resource_29" ;
resourceAssignments29.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments29.devId   = 212;
resourceAssignments29.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_FLOW_COMMON' ;
resourceAssignments29.subtypeid  =  0;
resourceAssignments29.resourcerangestart =  140;
resourceAssignments29.resourcecount = 160;






resourceAssignments30.$name  =  "resource_30" ;
resourceAssignments30.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments30.devId   = 212;
resourceAssignments30.subtype   = 'RESASG_SUBTYPE_UDMAP_INVALID_FLOW_OES' ;
resourceAssignments30.subtypeid  =  1;
resourceAssignments30.resourcerangestart =  0;
resourceAssignments30.resourcecount = 1;






resourceAssignments31.$name  =  "resource_31" ;
resourceAssignments31.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments31.devId   = 212;
resourceAssignments31.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_TRIGGER' ;
resourceAssignments31.subtypeid  =  2;
resourceAssignments31.resourcerangestart =  49152;
resourceAssignments31.resourcecount = 1024;






resourceAssignments32.$name  =  "resource_32" ;
resourceAssignments32.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments32.devId   = 212;
resourceAssignments32.subtype   = 'RESASG_SUBTYPE_UDMAP_GLOBAL_CONFIG' ;
resourceAssignments32.subtypeid  =  3;
resourceAssignments32.resourcerangestart =  0;
resourceAssignments32.resourcecount = 1;






resourceAssignments33.$name  =  "resource_33" ;
resourceAssignments33.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments33.devId   = 212;
resourceAssignments33.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_CHAN' ;
resourceAssignments33.subtypeid  =  10;
resourceAssignments33.resourcerangestart =  16;
resourceAssignments33.resourcecount = 124;






resourceAssignments34.$name  =  "resource_34" ;
resourceAssignments34.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments34.devId   = 212;
resourceAssignments34.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_HCHAN' ;
resourceAssignments34.subtypeid  =  11;
resourceAssignments34.resourcerangestart =  4;
resourceAssignments34.resourcecount = 12;






resourceAssignments35.$name  =  "resource_35" ;
resourceAssignments35.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments35.devId   = 212;
resourceAssignments35.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_UHCHAN' ;
resourceAssignments35.subtypeid  =  12;
resourceAssignments35.resourcerangestart =  0;
resourceAssignments35.resourcecount = 4;






