nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments36.$name  =  "resource_36" ;
resourceAssignments36.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments36.devId   = 212;
resourceAssignments36.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_CHAN' ;
resourceAssignments36.subtypeid  =  13;
resourceAssignments36.resourcerangestart =  16;
resourceAssignments36.resourcecount = 124;






resourceAssignments37.$name  =  "resource_37" ;
resourceAssignments37.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments37.devId   = 212;
resourceAssignments37.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_ECHAN' ;
resourceAssignments37.subtypeid  =  14;
resourceAssignments37.resourcerangestart =  140;
resourceAssignments37.resourcecount = 160;






resourceAssignments38.$name  =  "resource_38" ;
resourceAssignments38.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments38.devId   = 212;
resourceAssignments38.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_HCHAN' ;
resourceAssignments38.subtypeid  =  15;
resourceAssignments38.resourcerangestart =  4;
resourceAssignments38.resourcecount = 12;






resourceAssignments39.$name  =  "resource_39" ;
resourceAssignments39.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments39.devId   = 212;
resourceAssignments39.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_UHCHAN' ;
resourceAssignments39.subtypeid  =  16;
resourceAssignments39.resourcerangestart =  0;
resourceAssignments39.resourcecount = 4;






resourceAssignments40.$name  =  "resource_40" ;
resourceAssignments40.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments40.devId   = 213;
resourceAssignments40.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments40.subtypeid  =  0;
resourceAssignments40.resourcerangestart =  10;
resourceAssignments40.resourcecount = 178;






resourceAssignments41.$name  =  "resource_41" ;
resourceAssignments41.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments41.devId   = 213;
resourceAssignments41.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments41.subtypeid  =  213;
resourceAssignments41.resourcerangestart =  196;
resourceAssignments41.resourcecount = 28;






resourceAssignments42.$name  =  "resource_42" ;
resourceAssignments42.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments42.devId   = 213;
resourceAssignments42.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments42.subtypeid  =  213;
resourceAssignments42.resourcerangestart =  228;
resourceAssignments42.resourcecount = 28;






resourceAssignments43.$name  =  "resource_43" ;
resourceAssignments43.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments43.devId   = 213;
resourceAssignments43.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments43.subtypeid  =  213;
resourceAssignments43.resourcerangestart =  260;
resourceAssignments43.resourcecount = 28;






resourceAssignments44.$name  =  "resource_44" ;
resourceAssignments44.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments44.devId   = 213;
resourceAssignments44.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments44.subtypeid  =  213;
resourceAssignments44.resourcerangestart =  292;
resourceAssignments44.resourcecount = 52;






resourceAssignments45.$name  =  "resource_45" ;
resourceAssignments45.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments45.devId   = 213;
resourceAssignments45.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments45.subtypeid  =  213;
resourceAssignments45.resourcerangestart =  348;
resourceAssignments45.resourcecount = 28;






resourceAssignments46.$name  =  "resource_46" ;
resourceAssignments46.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments46.devId   = 213;
resourceAssignments46.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments46.subtypeid  =  213;
resourceAssignments46.resourcerangestart =  380;
resourceAssignments46.resourcecount = 132;






resourceAssignments47.$name  =  "resource_47" ;
resourceAssignments47.devname  = 'J721E_DEV_MCU_NAVSS0_INTAGGR_0' ;
resourceAssignments47.devId   = 233;
resourceAssignments47.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments47.subtypeid  =  10;
resourceAssignments47.resourcerangestart =  8;
resourceAssignments47.resourcecount = 248;






resourceAssignments48.$name  =  "resource_48" ;
resourceAssignments48.devname  = 'J721E_DEV_MCU_NAVSS0_INTAGGR_0' ;
resourceAssignments48.devId   = 233;
resourceAssignments48.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments48.subtypeid  =  13;
resourceAssignments48.resourcerangestart =  16392;
resourceAssignments48.resourcecount = 1528;






resourceAssignments49.$name  =  "resource_49" ;
resourceAssignments49.devname  = 'J721E_DEV_MCU_NAVSS0_PROXY_0' ;
resourceAssignments49.devId   = 234;
resourceAssignments49.subtype   = 'RESASG_SUBTYPE_PROXY_PROXIES' ;
resourceAssignments49.subtypeid  =  0;
resourceAssignments49.resourcerangestart =  1;
resourceAssignments49.resourcecount = 63;






resourceAssignments50.$name  =  "resource_50" ;
resourceAssignments50.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments50.devId   = 235;
resourceAssignments50.subtype   = 'RESASG_SUBTYPE_RA_ERROR_OES' ;
resourceAssignments50.subtypeid  =  0;
resourceAssignments50.resourcerangestart =  0;
resourceAssignments50.resourcecount = 1;






resourceAssignments51.$name  =  "resource_51" ;
resourceAssignments51.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments51.devId   = 235;
resourceAssignments51.subtype   = 'RESASG_SUBTYPE_RA_GP' ;
resourceAssignments51.subtypeid  =  1;
resourceAssignments51.resourcerangestart =  96;
resourceAssignments51.resourcecount = 156;






resourceAssignments52.$name  =  "resource_52" ;
resourceAssignments52.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments52.devId   = 235;
resourceAssignments52.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX' ;
resourceAssignments52.subtypeid  =  2;
resourceAssignments52.resourcerangestart =  50;
resourceAssignments52.resourcecount = 43;






