nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments53.$name  =  "resource_53" ;
resourceAssignments53.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments53.devId   = 235;
resourceAssignments53.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX' ;
resourceAssignments53.subtypeid  =  3;
resourceAssignments53.resourcerangestart =  2;
resourceAssignments53.resourcecount = 44;






resourceAssignments54.$name  =  "resource_54" ;
resourceAssignments54.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments54.devId   = 235;
resourceAssignments54.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_H' ;
resourceAssignments54.subtypeid  =  5;
resourceAssignments54.resourcerangestart =  48;
resourceAssignments54.resourcecount = 2;






resourceAssignments55.$name  =  "resource_55" ;
resourceAssignments55.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments55.devId   = 235;
resourceAssignments55.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_H' ;
resourceAssignments55.subtypeid  =  7;
resourceAssignments55.resourcerangestart =  0;
resourceAssignments55.resourcecount = 2;






resourceAssignments56.$name  =  "resource_56" ;
resourceAssignments56.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments56.devId   = 235;
resourceAssignments56.subtype   = 'RESASG_SUBTYPE_RA_VIRTID' ;
resourceAssignments56.subtypeid  =  10;
resourceAssignments56.resourcerangestart =  0;
resourceAssignments56.resourcecount = 4096;






resourceAssignments57.$name  =  "resource_57" ;
resourceAssignments57.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments57.devId   = 235;
resourceAssignments57.subtype   = 'RESASG_SUBTYPE_RA_MONITORS' ;
resourceAssignments57.subtypeid  =  11;
resourceAssignments57.resourcerangestart =  0;
resourceAssignments57.resourcecount = 32;






resourceAssignments58.$name  =  "resource_58" ;
resourceAssignments58.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments58.devId   = 236;
resourceAssignments58.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_FLOW_COMMON' ;
resourceAssignments58.subtypeid  =  0;
resourceAssignments58.resourcerangestart =  48;
resourceAssignments58.resourcecount = 48;






resourceAssignments59.$name  =  "resource_59" ;
resourceAssignments59.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments59.devId   = 236;
resourceAssignments59.subtype   = 'RESASG_SUBTYPE_UDMAP_INVALID_FLOW_OES' ;
resourceAssignments59.subtypeid  =  1;
resourceAssignments59.resourcerangestart =  0;
resourceAssignments59.resourcecount = 1;






resourceAssignments60.$name  =  "resource_60" ;
resourceAssignments60.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments60.devId   = 236;
resourceAssignments60.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_TRIGGER' ;
resourceAssignments60.subtypeid  =  2;
resourceAssignments60.resourcerangestart =  56320;
resourceAssignments60.resourcecount = 256;






resourceAssignments61.$name  =  "resource_61" ;
resourceAssignments61.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments61.devId   = 236;
resourceAssignments61.subtype   = 'RESASG_SUBTYPE_UDMAP_GLOBAL_CONFIG' ;
resourceAssignments61.subtypeid  =  3;
resourceAssignments61.resourcerangestart =  0;
resourceAssignments61.resourcecount = 1;






resourceAssignments62.$name  =  "resource_62" ;
resourceAssignments62.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments62.devId   = 236;
resourceAssignments62.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_CHAN' ;
resourceAssignments62.subtypeid  =  10;
resourceAssignments62.resourcerangestart =  2;
resourceAssignments62.resourcecount = 43;






resourceAssignments63.$name  =  "resource_63" ;
resourceAssignments63.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments63.devId   = 236;
resourceAssignments63.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_HCHAN' ;
resourceAssignments63.subtypeid  =  11;
resourceAssignments63.resourcerangestart =  0;
resourceAssignments63.resourcecount = 2;






resourceAssignments64.$name  =  "resource_64" ;
resourceAssignments64.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments64.devId   = 236;
resourceAssignments64.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_CHAN' ;
resourceAssignments64.subtypeid  =  13;
resourceAssignments64.resourcerangestart =  2;
resourceAssignments64.resourcecount = 44;






resourceAssignments65.$name  =  "resource_65" ;
resourceAssignments65.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments65.devId   = 236;
resourceAssignments65.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_HCHAN' ;
resourceAssignments65.subtypeid  =  15;
resourceAssignments65.resourcerangestart =  0;
resourceAssignments65.resourcecount = 2;






resourceAssignments66.$name  =  "resource_66" ;
resourceAssignments66.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments66.devId   = 237;
resourceAssignments66.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments66.subtypeid  =  0;
resourceAssignments66.resourcerangestart =  4;
resourceAssignments66.resourcecount = 28;






resourceAssignments67.$name  =  "resource_67" ;
resourceAssignments67.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments67.devId   = 237;
resourceAssignments67.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments67.subtypeid  =  237;
resourceAssignments67.resourcerangestart =  36;
resourceAssignments67.resourcecount = 28;






